brew "act"
brew "argoproj/tap/kubectl-argo-rollouts"
brew "asdf"
brew "autoconf"
brew "automake"
brew "bash"
brew "bazel"
brew "bfg"
brew "bison"
brew "bsdiff"
brew "canva/packages/infra-tools"
brew "cloudflare/cloudflare/cloudflared"
brew "deno"
brew "gawk"
brew "gcc"
brew "gd"
brew "gomplate"
brew "hadolint"
brew "harfbuzz"
brew "kubeconform"
brew "kubectx"
brew "kubeseal"
brew "kubeval"
brew "libiconv"
brew "libmagic"
brew "librsvg"
brew "libsodium"
brew "lindell/multi-gitter/multi-gitter"
brew "moreutils"
brew "nativefier"
brew "packer"
brew "pango"
brew "pkg-config"
brew "poppler"
brew "protobuf"
brew "stern"
brew "re2c"
brew "remove-bg/tap/removebg"
brew "shellcheck"
brew "telnet"
brew "terraform-ls"
brew "thefuck"
brew "vips"
brew "watch"
brew "watchman"
brew "yq"
brew "zlib"
brew "zplug"
cask "brooklyn"
cask "chromedriver"
cask "dropbox"
cask "fantastical"
cask "fig"
cask "fliqlo"
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "gitify"
cask "kaleidoscope"
cask "little-snitch"
cask "steam"
cask "syntax-highlight"
cask "tunnelbear"
cask "vial"
