# brew bundle dump --describe --taps --brews --casks --mas --whalebrew

#####################################################################
# Taps                                                              #
#####################################################################
tap "buo/cask-upgrade"
tap "derailed/popeye"
tap "dnlggr/tap"
tap "domt4/autoupdate"
tap "drud/ddev"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/core"
tap "moncho/dry"
tap "odlp/bluesnooze"
tap "stern/stern"


#####################################################################
# Brews                                                             #
#####################################################################

# Build tools
brew "autoconf"
brew "automake"
brew "bsdiff"
brew "gettext"
brew "libmagic"
brew "pkg-config"
brew "vips"
brew "zlib"

# Development
brew "composer"
brew "crystal"
brew "drud/ddev/ddev"
brew "go"
brew "node"
brew "php@7.4"
brew "php@8.0"
brew "python@3.9"
brew "redis"
brew "rust"
brew "yarn"

# Shell / Terminal
brew "colordiff"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "dialog"
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "gnu-sed" # Install GNU `sed` as gsed
brew "gnu-tar" # Install GNU `tar` as gtar
brew "grc"
brew "htop"
brew "jq"
brew "moreutils" # Install some other useful utilities like `sponge`.
brew "mosh"
brew "mtr"
brew "neofetch"
brew "nmap"
brew "starship"
brew "terminal-notifier"
brew "tldr"
brew "wget"
brew "yh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Hardware
brew "dfu-util" # USB programmer
brew "esptool" # ESP8266 and ESP32 serial bootloader utility

# Git
brew "gh"
brew "git-extras"
brew "git-lfs"
brew "git"
brew "svn" # for checking out fonts later

# GnuPG
brew "gnupg2"
brew "pinentry-mac"

# Docker
brew "ctop"
brew "lazydocker"
brew "moncho/dry/dry"

# Kubernetes
brew "derailed/popeye/popeye"
brew "helm"
brew "minikube"
brew "stern/stern/stern"

# Image processing
brew "exiftool" # Perl lib for reading and writing EXIF metadata
brew "gifsicle"
brew "imagemagick"
brew "jpegoptim"
brew "media-info"
brew "optipng"
brew "pngcrush"
brew "pngquant"
brew "svgo"

# Utilities
brew "dnlggr/tap/kraken-btc"
brew "fileicon"
brew "gpsbabel"
brew "mackup"
brew "mas"
brew "pock"
brew "whalebrew"

#####################################################################
# Casks                                                             #
#####################################################################
cask "1password-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "adobe-dng-converter"
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "arduino"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "bartender"
cask "bluesnooze"
cask "calibre"
cask "dash"
cask "desktoppr"
cask "discord"
cask "docker"
cask "firefox"
cask "fritzing"
cask "gcc-arm-embedded"
cask "gltfquicklook"
cask "gpg-suite"
cask "hazel"
cask "iterm2"
cask "kindle-previewer"
cask "micro-snitch"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mongodb-compass"
cask "nordic-nrf-command-line-tools"
cask "optimage"
cask "osxfuse"
cask "paw"
cask "phpstorm"
cask "pictogram"
cask "plex-media-player"
cask "psequel"
cask "quik"
cask "rubitrack-pro"
cask "rubymine"
cask "segger-jlink"
cask "sequel-pro"
cask "shifty"
cask "sip"
cask "skype"
cask "spotify"
cask "sweet-home3d"
cask "teamviewer"
cask "textmate"
cask "tower"
cask "transmit"
cask "ultimaker-cura"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Work: kaleido.ai
cask "google-cloud-sdk"
cask "miro"
cask "notion"
cask "removebg"

# Quicklook
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-fira-code"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-fira-sans"
cask "font-hack-nerd-font"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro-for-powerline"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"


#####################################################################
# MacOS App Store                                                   #
#####################################################################
mas "AdGuard for Safari", id: 1440147259
mas "BaseCamp", id: 411052274
mas "Better Rename 9", id: 414209656
mas "Deliveries", id: 290986013
mas "Dynamo", id: 1445910651
mas "Fantastical", id: 975937182
mas "GAget", id: 968487158
mas "GIF Brewery 3", id: 1081413713
mas "Gifox", id: 1461845568
mas "Keynote", id: 409183694
mas "Link Unshortener", id: 1506953658
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Remote Desktop", id: 1295203466
mas "Next Meeting", id: 1017470484
mas "NordVPN IKE", id: 1116599239
mas "Numbers", id: 409203825
mas "NZBin", id: 979608899
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Reeder", id: 1529448980
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "Tampermonkey", id: 1482490089
mas "Termius", id: 1176074088
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "ToothFairy", id: 1191449274
mas "WhatsApp", id: 1147396723


#####################################################################
# Whalebrew                                                         #
#####################################################################
whalebrew "redis"
whalebrew "whalebrew/awscli"
whalebrew "whalebrew/shellcheck"
whalebrew "whalebrew/terraform"
whalebrew "whalebrew/travis"
whalebrew "whalebrew/whalesay"
whalebrew "otherguy/pokemonsay"
