# brew bundle dump --describe --taps --brews --casks --mas --whalebrew

#####################################################################
# Brews                                                             #
#####################################################################

# Build tools
brew "autoconf"
brew "automake"
brew "bison"
brew "bsdiff"
brew "gcc"
brew "gettext"
brew "gmp"
brew "libiconv"
brew "libmagic"
brew "libsodium"
brew "pkg-config"
brew "re2c"
brew "vips"
brew "yamllint"
brew "zlib"



# Development
brew "act"
brew "asdf"

# Shell / Terminal
brew "colordiff"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "curl"
brew "dialog"
brew "fetch"
brew "findutils" # Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "gnu-sed" # Install GNU `sed` as gsed
brew "gnu-tar" # Install GNU `tar` as gtar
brew "grc"
brew "grep"
brew "htop"
brew "jq"
brew "moreutils" # Install some other useful utilities like `sponge`.
brew "mosh"
brew "mtr"
brew "neofetch"
brew "nmap"
brew "python-yq"
brew "qrencode"
brew "starship"
brew "terminal-notifier"
brew "tldr"
brew "tree"
brew "wget"
brew "yh"
brew "z"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# Hardware
brew "avrdude"
brew "dfu-util" # USB programmer
brew "esptool" # ESP8266 and ESP32 serial bootloader utility
brew "picocom"

# Git
brew "gh"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "svn" # for checking out fonts later

# GnuPG
brew "gnupg2"
brew "paperkey"
brew "pinentry-mac"

# Docker
brew "ctop"
brew "dive"
brew "lazydocker"
brew "moncho/dry/dry"

# Kubernetes
brew "arttor/tap/helmify"
brew "derailed/popeye/popeye"
brew "helm"
brew "instrumenta/instrumenta/kubeval"
brew "kube-score/tap/kube-score"
brew "kubernetes-cli", link: false
brew "kustomize"
brew "minikube"
brew "stern/stern/stern"

# Image processing
brew "exiftool" # Perl lib for reading and writing EXIF metadata
brew "ffmpeg"
brew "gifsicle"
brew "imagemagick"
brew "jpegoptim"
brew "media-info"
brew "optipng"
brew "pngcrush"
brew "pngquant"
brew "svgo"

# Utilities
brew "dnlggr/tap/kraken-btc"
brew "doctl"
brew "fileicon"
brew "gpsbabel"
brew "mackup"
brew "mas"
brew "pock"
brew "pwgen"
brew "siege"
brew "upx"
brew "whalebrew"
brew "ykman"


#####################################################################
# Casks                                                             #
#####################################################################
cask "1password"
cask "1password-cli"
cask "adobe-creative-cloud"
cask "adobe-dng-converter"
cask "aerial"
cask "alfred"
cask "appcleaner"
cask "arduino"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "bartender"
cask "bluesnooze"
cask "calibre"
cask "dash"
cask "desktoppr"
cask "discord"
cask "docker"
cask "firefox"
cask "fritzing"
cask "garmin-express"
cask "gcc-arm-embedded"
cask "gltfquicklook"
cask "gpg-suite"
cask "hazel"
cask "iterm2"
cask "kindle-previewer"
cask "lunar"
cask "micro-snitch"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mongodb-compass"
cask "nordic-nrf-command-line-tools"
cask "optimage"
cask "osxfuse"
cask "paw"
cask "pictogram"
cask "plex-media-player"
cask "pock"
cask "psequel"
cask "quik"
cask "rubitrack-pro"
cask "segger-jlink"
cask "sequel-pro"
cask "shifty"
cask "sip"
cask "skype"
cask "spotify"
cask "sweet-home3d"
cask "teamviewer"
cask "textmate"
cask "tower"
cask "transmission"
cask "transmit"
cask "twitch"
cask "ultimaker-cura"
cask "viscosity"
cask "visual-studio-code"
cask "vlc"
cask "yubico-yubikey-manager"

# Work: Kaleido / Canva
brew "amazon-ecs-cli"
brew "argocd"
brew "awscli"
brew "circleci"
cask "google-cloud-sdk"
cask "miro"
cask "notion"
cask "removebg"
cask "rubymine"
cask "zoom"

# Quicklook
cask "qlmarkdown"
cask "quicklook-csv"
cask "quicklook-json"

# Fonts
cask "font-cascadia-code"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-pl"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-fira-sans-condensed"
cask "font-fira-sans-extra-condensed"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-lato"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-code-pro-for-powerline"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
