# brew bundle dump --describe --taps --brews --casks --mas --whalebrew


#####################################################################
# Taps                                                              #
#####################################################################

tap "lindell/multi-gitter"                  # Tap for the multi-gitter Git automation CLI
tap "cloudflare/cloudflare"                 # Cloudflare developer tools and CLIs tap
tap "derailed/popeye"                       # Tap packaging the Popeye Kubernetes scanner
tap "mongodb/brew"                          # MongoDB-supported database tooling tap
tap "osx-cross/arm"                         # Cross-compilation toolchains for ARM targets tap
tap "osx-cross/avr"                         # AVR cross-compilation toolchain tap
tap "qmk/qmk"                               # QMK firmware CLI tap for mechanical keyboards

#####################################################################
# Brews                                                             #
#####################################################################

# Essential
brew "starship"                             # Cross-shell prompt for astronauts; The minimal, blazing-fast, and infinitely customizable prompt for any shell!
brew "stow"                                 # Organize software neatly under a single directory tree (e.g. /usr/local); Organize your dotfiles
brew "zplug"                                # Next-generation plugin manager for zsh; A next-generation plugin manager for zsh
brew "topgrade"                             # Upgrade all the things; Upgrade all the things - package managers, applications, OSes, etc.

# Build tools
brew "autoconf"                             # Automatic configure script builder
brew "automake"                             # Tool for generating GNU Standards-compliant Makefiles
brew "boost"                                # Collection of portable C++ source libraries
brew "bsdiff"                               # Generate and apply patches to binary files
brew "gcc"                                  # GNU compiler collection
brew "gettext"                              # GNU internationalization (i18n) and localization (l10n) library
brew "glib"                                 # Core application library for C
brew "libiconv"                             # Conversion library
brew "libmagic"                             # Implementation of the file(1) command
brew "libpq", link: true                    # Postgres C API library
brew "pkgconf"                              # Package compiler and linker metadata toolkit
brew "qt"                                   # Cross-platform application and UI framework
brew "vips"                                 # Image processing library
brew "yamllint"                             # Linter for YAML files
brew "zlib"                                 # General-purpose lossless data-compression library

# Development
brew "act"                                  # Run your GitHub Actions locally
brew "ast-grep"                             # Code searching, linting, rewriting
brew "cocoapods"                            # Dependency manager for Cocoa projects
brew "gomplate"                             # Command-line Golang template processor; Command-line tool for template rendering
brew "llm"                                  # Access large language models from the command-line
brew "markdownlint-cli2"                    # Fast, flexible, config-based cli for linting Markdown/CommonMark files
brew "mise"                                 # Polyglot runtime manager (asdf rust clone); Extendable version manager with support for Ruby, Node.js, Elixir, Erlang & more
brew "mongodb/brew/mongodb-database-tools"  # This package contains standard utilities for interacting with MongoDB.
brew "sonar-scanner"                        # Launcher to analyze a project with SonarQube
brew "tokei"                                # Program that allows you to count code, quickly

# Shell / Terminal
brew "colordiff"                            # Color-highlighted diff(1) output
brew "coreutils"                            # GNU File, Shell, and Text utilities
brew "curl"                                 # Get a file from an HTTP, HTTPS or FTP server
brew "datamash"                             # Tool to perform numerical, textual & statistical operations
brew "dialog"                               # Display user-friendly message boxes from shell scripts
brew "direnv"                               # Load/unload environment variables based on $PWD
brew "fblog"                                # Small command-line JSON log viewer
brew "findutils"                            # Collection of GNU find, xargs, and locate; Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "folderify"                            # Create custom icons for folders in macOS
brew "fzf"                                  # Command-line fuzzy finder written in Go
brew "gawk"                                 # GNU awk utility
brew "gnu-sed"                              # GNU implementation of the famous stream editor; Install GNU `sed` as gsed
brew "gnu-tar"                              # GNU version of the tar archiving utility; Install GNU `tar` as gtar
brew "grc"                                  # Colorize logfiles and command output; Colourize logfiles and command output
brew "grep"                                 # GNU grep, egrep and fgrep
brew "gzip"                                 # Popular GNU data compression program
brew "htop"                                 # Improved top (interactive process viewer)
brew "httpstat"                             # Curl statistics made simple
brew "jq"                                   # Lightweight and flexible command-line JSON processor
brew "jsonpp"                               # Command-line JSON pretty-printer
brew "lsd"                                  # Clone of ls with colorful output, file type icons, and more; The next gen ls command
brew "moreutils"                            # Collection of tools that nobody wrote when UNIX was young; Install some other useful utilities like `sponge`.
brew "mtr"                                  # 'traceroute' and 'ping' in a single tool; Traceroute and ping in a single tool
brew "nmap"                                 # Port scanning utility for large networks
brew "ripgrep"                              # Search tool like grep and The Silver Searcher
brew "rsync"                                # Utility that provides fast incremental file transfer
brew "telnet"                               # User interface to the TELNET protocol
brew "terminal-notifier"                    # Send macOS User Notifications from the command-line
brew "tldr"                                 # Simplified and community-driven man pages
brew "tree"                                 # Display directories as trees (with optional color/HTML output)
brew "watch"                                # Executes a program periodically, showing output fullscreen
brew "wget"                                 # Internet file retriever
brew "xmlstarlet"                           # XML command-line utilities
brew "yh"                                   # YAML syntax highlighter to bring colours where only jq could; Yaml syntax highlighting
brew "yq"                                   # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "z"                                    # Tracks most-used directories to make cd smarter; Tracks your most used directories to make 'cd' smarter
brew "zsh-completions"                      # Additional completion definitions for zsh
brew "zsh-syntax-highlighting"              # Fish shell like syntax highlighting for zsh

# Hardware
brew "avrdude"                              # Atmel AVR MCU programmer
brew "dfu-util"                             # USB programmer
brew "esptool"                              # ESP8266 and ESP32 serial bootloader utility
brew "qmk/qmk/qmk"                          # Quantum Mechanical Keyboard (QMK) Firmware

# Git
brew "bfg"                                  # Remove large files or passwords from Git history like git-filter-branch
brew "gh"                                   # GitHub command-line tool
brew "git-extras"                           # Small git utilities
brew "git-delta"                            # Syntax-highlighting pager for git and diff output
brew "git"                                  # Distributed revision control system
brew "lazygit"                              # Simple terminal UI for git commands

# GnuPG
brew "gnupg"                                # GNU Pretty Good Privacy (PGP) package
brew "paperkey"                             # Extract just secret information out of OpenPGP secret keys
brew "pinentry-mac"                         # Pinentry for GPG on Mac

# Docker
brew "ctop"                                 # Top-like interface for container metrics
brew "dive"                                 # Tool for exploring each layer in a docker image
brew "lazydocker"                           # Lazier way to manage everything docker
brew "hadolint"                             # Smarter Dockerfile linter to validate best practices

# Kubernetes
brew "fluent-bit"                           # Fast and Lightweight Logs and Metrics processor
brew "helm"                                 # Kubernetes package manager
brew "helm-ls"                              # Language server for Helm
brew "kube-score"                           # Kubernetes object analysis recommendations for improved reliability and security
brew "kubeconform"                          # FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubectx"                              # Tool that can switch between kubectl contexts easily and create aliases
brew "kubeseal"                             # Kubernetes controller and tool for one-way encrypted Secrets
brew "kustomize"                            # Template-free customization of Kubernetes YAML manifests
brew "popeye"                               # Kubernetes cluster resource sanitizer
brew "stern"                                # Tail multiple Kubernetes pods & their containers

# Image processing
brew "aom"                                  # Codec library for encoding and decoding AV1 video streams
brew "exiftool"                             # Perl lib for reading and writing EXIF metadata
brew "ffmpeg"                               # Play, record, convert, and stream audio and video
brew "gdk-pixbuf"                           # Toolkit for image loading and pixel buffer manipulation
brew "ghostscript"                          # Interpreter for PostScript and PDF
brew "imagemagick"                          # Tools and libraries to manipulate images in many formats
brew "jpeg-xl"                              # New file format for still image compression
brew "jpegoptim"                            # Utility to optimize JPEG files
brew "leptonica"                            # Image processing and image analysis library
brew "libheif"                              # ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libraw"                               # Library for reading RAW files from digital photo cameras
brew "librsvg"                              # Library to render SVG files using Cairo
brew "media-info"                           # Unified display of technical and tag data for audio/video
brew "optipng"                              # PNG file optimizer
brew "pngcrush"                             # Optimizer for PNG files
brew "pngquant"                             # PNG image optimizing utility
brew "tesseract"                            # OCR (Optical Character Recognition) engine
brew "webp"                                 # Image format providing lossless and lossy compression for web images

# Utilities
brew "doctl"                                # Command-line tool for DigitalOcean; DigitalOcean command line interface
brew "dockutil"                             # Command-line utility for managing macOS Dock items
brew "fileicon"                             # macOS CLI for managing custom icons for files and folders
brew "gpsbabel"                             # Converts/uploads GPS waypoints, tracks, and routes
brew "mas"                                  # Mac App Store command-line interface
brew "pwgen"                                # Password generator
brew "redis"                                # Persistent key-value database, with built-in net interface
brew "siege"                                # HTTP regression testing and benchmarking utility
brew "trash", link: true                    # CLI tool that moves files or folder to the trash
brew "upx"                                  # Compress/expand executable files
brew "whalebrew"                            # Homebrew, but with Docker images
brew "ykman"                                # Tool for managing your YubiKey configuration

# Quicklook
cask "qlmarkdown"                           # Quick Look generator for Markdown files
cask "quicklook-csv"                        # Quick Look plugin for CSV files
cask "quicklook-json"                       # Quick Look plugin for JSON files

# Fonts
cask "font-cascadia-code-pl"                # Cascadia Code PL
cask "font-cascadia-code"                   # Cascadia Code
cask "font-cascadia-mono-pl"                # Cascadia Mono PL
cask "font-cascadia-mono"                   # Cascadia Mono
cask "font-fira-code-nerd-font"             # FiraCode Nerd Font (Fira Code)
cask "font-fira-code"                       # Fira Code
cask "font-fira-mono-for-powerline"         # Fira Mono for Powerline
cask "font-fira-mono-nerd-font"             # FiraMono Nerd Font (Fira)
cask "font-fira-mono"                       # Fira Mono
cask "font-fira-sans-condensed"             # Fira Sans Condensed
cask "font-fira-sans-extra-condensed"       # Fira Sans Extra Condensed
cask "font-fira-sans"                       # Fira Sans
cask "font-hack-nerd-font"                  # Hack Nerd Font (Hack)
cask "font-ia-writer-duo"                   # iA Writer Duo
cask "font-ia-writer-mono"                  # iA Writer Mono
cask "font-ia-writer-quattro"               # iA Writer Quattro
cask "font-ibm-plex-mono"                   # IBM Plex Mono
cask "font-inter"                           # Inter
cask "font-lato"                            # Lato
cask "font-open-sans"                       # Open Sans
cask "font-roboto"                          # Roboto
cask "font-sf-mono"                         # San Francisco Mono
cask "font-source-code-pro-for-powerline"   # Source Code Pro for Powerline
cask "font-source-code-pro"                 # Source Code Pro

#####################################################################
# Whalebrew                                                         #
#####################################################################

# !!! Temporarily disabled
# whalebrew "otherguy/pokemonsay"
# whalebrew "otherguy/yamlfix"

#####################################################################
# Casks                                                             #
#####################################################################
cask "1password-cli"
cask "1password"
cask "adobe-creative-cloud"
cask "adobe-dng-converter"
cask "aerial"                               # Apple TV Aerial screensaver
cask "android-platform-tools"               # Android SDK component
cask "appcleaner"                           # Application uninstaller
cask "balenaetcher"                         # Tool to flash OS images to SD cards & USB drives
cask "brooklyn"                             # Screen saver based on animations presented during Apple Special Event Brooklyn
cask "calibre"                              # E-books management software
cask "chatgpt"                              # ChatGPT desktop app
cask "claude"                               # Anthropic's official Claude AI desktop app
cask "claude-code"                          # Anthropic's official Claude Code desktop app
cask "codex"                                # OpenAI Codex app
cask "discord"                              # Voice and text chat software
cask "docker-desktop"
cask "fantastical"                          # Calendar software
cask "fliqlo"                               # Flip clock screensaver
cask "garmin-express"                       # Update maps and software, sync with Garmin Connect and register your device
cask "gpg-suite"                            # Tools to protect your emails and files
cask "hazel"                                # Automate repetitive tasks on your Mac
cask "iterm2"
cask "kaleidoscope"                         # Spot and merge differences in text and image files or folders
cask "macfuse"
cask "maestral"                             # Open-source Dropbox client
cask "micro-snitch"                         # Monitor and notify when your microphone or camera is activated
cask "lindell/multi-gitter/multi-gitter"    # Update multiple repositories in bulk
cask "optimage"
cask "rapidapi"                             # HTTP client that helps testing and describing APIs
cask "raycast"                              # Control your tools with a few keystrokes
cask "setapp"                               # Collection of apps available by subscription
cask "shifty"                               # Menu bar app that provides more control over Night Shift
cask "spotify"
cask "syntax-highlight"                     # Quicklook extension for source files
cask "textmate"                             # General-purpose text editor
cask "tower"                                # Git client focusing on power and productivity
cask "transmission"                         # Open-source BitTorrent client
cask "tunnelbear"                           # VPN client for secure internet access and private browsing
cask "vial"                                 # Configurator of compatible keyboards in real time
cask "viscosity"                            # OpenVPN client with AppleScript support
cask "visual-studio-code"
cask "vlc"

#####################################################################
# macOS App Store                                                   #
#####################################################################

mas "1Password for Safari", id: 1569813296
mas "AquaColorFix", id: 1579618383
mas "DiveLogDT", id: 411603212
mas "Hush", id: 1544743900
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "Mela", id: 1568924476
mas "Name Mangler 3", id: 603637384
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Pages", id: 409201541
mas "Pieoneer", id: 6739781207
mas "PiPifier", id: 1160374471
mas "Raycast Companion", id: 6738274497
mas "rubiTrack 6", id: 1557892760
mas "StopTheMadness", id: 1376402589
mas "Sweet Home 3D", id: 669289700
mas "Things", id: 904280696
mas "Whisper Transcription", id: 1668083311
mas "Xcode", id: 497799835
